Repository: nguyenthanh29122003/thanhngx12-smart_watch_flutter
Catalog: lib/l10n/app_*.arb
Languages: vi

# appTitle
source: Smart Wearable App
vi: Ứng dụng Đeo Thông minh

# settingsTitle
source: Settings
vi: Cài đặt

# dashboardTitle
source: Dashboard
vi: Bảng điều khiển

# relativesTitle
source: Relatives
vi: Người thân

# goalsTitle
source: Goals
vi: Mục tiêu

# loginTitle
source: Login
vi: Đăng nhập

# selectDeviceTitle
source: Select Device
vi: Chọn Thiết bị

# configureWifiTitle
source: Configure Device WiFi
vi: Cấu hình WiFi Thiết bị

source: Language
vi: Ngôn ngữ

source: Appearance
vi: Giao diện

source: System Default
vi: Mặc định Hệ thống

source: Light Mode
vi: Chế độ Sáng

source: Dark Mode
vi: Chế độ Tối

source: Logout
vi: Đăng xuất

source: Add Relative
vi: Thêm Người thân

source: Name
vi: Tên

source: Relationship
vi: Mối quan hệ

source: Cancel
vi: Hủy

source: Add
vi: Thêm

source: Delete
vi: Xóa

source: Confirm Deletion
vi: Xác nhận Xóa

# confirmDeleteRelative
source: Are you sure you want to delete {relativeName} ({relativeRelationship})?
vi: Bạn chắc chắn muốn xóa {relativeName} ({relativeRelationship})?

# relativeAddedSuccess
source: Relative added successfully!
vi: Đã thêm người thân thành công!

# relativeAddedError
source: Failed to add relative.
vi: Thêm người thân thất bại.

# relativeDeletedSuccess
source: Relative deleted.
vi: Đã xóa người thân.

# relativeDeletedError
source: Failed to delete relative.
vi: Xóa người thân thất bại.

# confirmLogoutTitle
source: Confirm Logout
vi: Xác nhận Đăng xuất

# confirmLogoutMessage
source: Are you sure you want to logout?
vi: Bạn có chắc chắn muốn đăng xuất?

source: Confirm
vi: Đồng ý

# chatbotTitle
source: Chat with AI
vi: Trò chuyện với AI

# predictTitle
source: Predict
vi: Dự đoán

source: Connect Device
vi: Kết nối Thiết bị

# predictPlaceholder
source: Prediction functionality coming soon!
vi: Chức năng dự đoán đang được phát triển!

# sendMessage
source: Send
vi: Gửi

# enterMessage
source: Enter your message or question
vi: Nhập tin nhắn hoặc câu hỏi của bạn

# imageUrlLabel
source: Enter image URL (optional)
vi: Nhập URL hình ảnh (tùy chọn)

source: Error sending message
vi: Lỗi khi gửi tin nhắn

# healthDisclaimer
source: This is general information, not medical advice. Please consult a doctor for professional advice.
vi: Đây là thông tin chung, không phải lời khuyên y tế. Hãy tham khảo ý kiến bác sĩ để được tư vấn chuyên nghiệp.

# relativesScreenTitle
source: Relatives
vi: Người thân

# addRelativeTooltip
source: Add Relative
vi: Thêm Người thân

# addRelativeDialogTitle
source: Add New Relative
vi: Thêm Người thân Mới

# relativeNameLabel
source: Name
vi: Tên

# relativeNameHint
source: Enter relative's full name
vi: Nhập họ và tên người thân

# relativeNameValidation
source: Please enter a name
vi: Vui lòng nhập tên

# relationshipLabel
source: Relationship
vi: Mối quan hệ

# relationshipHint
source: Select relationship
vi: Chọn mối quan hệ

# relationshipValidation
source: Please select a relationship
vi: Vui lòng chọn mối quan hệ

# addRelativeButton
source: Add Relative
vi: Thêm Người thân

# deleteButton
source: Delete
vi: Xóa

# deleteRelativeConfirmationTitle
source: Confirm Deletion
vi: Xác nhận Xóa

# relativeDeletedSnackbar
source: Deleted relative '{relativeName}'.
vi: Đã xóa người thân '{relativeName}'.

# pleaseLoginRelatives
source: Please login to manage relatives.
vi: Vui lòng đăng nhập để quản lý người thân.

source: No relatives yet.
vi: Chưa có người thân nào.

# addFirstRelativeHint
source: Press the + button above to add your first relative.
vi: Nhấn nút + phía trên để thêm người thân đầu tiên.

# addRelativeEmptyButton
source: Add Relative
vi: Thêm Người thân

# deleteRelativeTooltip
source: Delete {relativeName}
vi: Xóa {relativeName}

# editRelativeDialogTitle
source: Edit Relative
vi: Sửa Người thân

# saveChangesButton
source: Save Changes
vi: Lưu Thay đổi

# relativeUpdatedSuccess
source: Relative updated successfully!
vi: Đã cập nhật người thân thành công!

# relativeUpdatedError
source: Failed to update relative.
vi: Cập nhật người thân thất bại.

# editRelativeTooltip
source: Edit {relativeName}
vi: Sửa {relativeName}

# relationFather
source: Father
vi: Bố

# relationMother
source: Mother
vi: Mẹ

# relationSon
source: Son
vi: Con trai

# relationDaughter
source: Daughter
vi: Con gái

# relationBrother
source: Brother
vi: Anh/Em trai

# relationSister
source: Sister
vi: Chị/Em gái

# relationGrandfather
source: Grandfather
vi: Ông

# relationGrandmother
source: Grandmother
vi: Bà

# relationFriend
source: Friend
vi: Bạn bè

# relationSpouse
source: Spouse
vi: Vợ/Chồng

# relationPartner
source: Partner
vi: Bạn đời

# relationGuardian
source: Guardian
vi: Người giám hộ

# relationDoctor
source: Doctor
vi: Bác sĩ

# relationCaregiver
source: Caregiver
vi: Người chăm sóc

# relationOther
source: Other
vi: Khác

# sectionDeviceManagement
source: Device Management
vi: Quản lý Thiết bị

# sectionNetwork
source: Network
vi: Mạng

source: No Device Connected
vi: Chưa kết nối Thiết bị

# connectPrompt
source: Connect via "Change Device"
vi: Kết nối qua "Đổi Thiết bị"

# disconnectButton
source: Disconnect
vi: Ngắt kết nối

source: Change / Forget Device
vi: Đổi / Quên Thiết bị

# connectDeviceFirstSnackbar
source: Please connect to a device first.
vi: Vui lòng kết nối thiết bị trước.

source: No Email
vi: Không có Email

# welcomeUser
source: Welcome, {userName}!
vi: Chào mừng, {userName}!

# defaultUser
source: User
vi: Người dùng

# bleStatusConnected
source: BLE: Connected
vi: BLE: Đã kết nối

# bleStatusConnecting
source: BLE: Connecting
vi: BLE: Đang kết nối

# bleStatusDisconnected
source: BLE: Disconnected
vi: BLE: Đã ngắt

# bleStatusScanning
source: BLE: Scanning
vi: BLE: Đang quét

# bleStatusError
source: BLE: Error
vi: BLE: Lỗi

# bleStatusUnknown
source: BLE: Unknown
vi: BLE: Không rõ

# wifiStatusOn
source: WiFi On
vi: WiFi Bật

# wifiStatusOff
source: WiFi Off
vi: WiFi Tắt

# testNotificationButton
source: Test Notification
vi: Thử Thông báo

# testNotificationSent
source: Test notification sent! Check system.
vi: Đã gửi thông báo thử! Kiểm tra hệ thống.

# goalProgressTitle
source: Daily Goal Progress
vi: Tiến độ Mục tiêu Ngày

# goalLoading
source: Loading goal...
vi: Đang tải mục tiêu...

# stepsCalculating
source: Calculating steps...
vi: Đang tính số bước...

# stepsProgress
source: Steps: {steps} / {goal}
vi: Bước: {steps} / {goal}

# errorNavigateGoals
source: Could not navigate to Goals screen.
vi: Không thể điều hướng đến màn hình Mục tiêu.

# realtimeMetricsTitle
source: Realtime Metrics
vi: Chỉ số Thời gian thực

# heartRateLabel
source: Heart Rate
vi: Nhịp tim

# stepsLabel
source: Steps
vi: Số bước

# lastUpdatedPrefix
source: Updated:
vi: Cập nhật:

# waitingForData
source: Connected. Waiting for data...
vi: Đã kết nối. Đang chờ dữ liệu...

# connectingStatus
source: Connecting...
vi: Đang kết nối...

# connectionErrorStatus
source: Connection error.
vi: Lỗi kết nối.

# disconnectedStatus
source: Device disconnected.
vi: Thiết bị đã ngắt kết nối.

# hrHistoryTitle
source: Heart Rate History (Last 24h)
vi: Lịch sử Nhịp tim (24 giờ qua)

# spo2HistoryTitle
source: SpO₂ History (Last 24h)
vi: Lịch sử SpO₂ (24 giờ qua)

# stepsHistoryTitle
source: Hourly Steps (Last 24h)
vi: Số bước Mỗi giờ (24 giờ qua)

# chartErrorPrefix
source: Error:
vi: Lỗi:

# chartCouldNotLoad
source: Could not load history
vi: Không thể tải lịch sử

# chartNoDataPeriod
source: No history data for this period.
vi: Không có dữ liệu lịch sử cho khoảng thời gian này.

# chartNoValidHr
source: No valid heart rate data found in this period.
vi: Không tìm thấy dữ liệu nhịp tim hợp lệ trong khoảng này.

# chartNoValidSpo2
source: No valid SpO₂ data (>= {minSpo2}%) found in this period.
vi: Không tìm thấy dữ liệu SpO₂ hợp lệ (>= {minSpo2}%) trong khoảng này.

# chartNoStepsCalculated
source: No step data calculated for this period.
vi: Không có dữ liệu bước được tính cho khoảng này.

# emailValidation
source: Please enter a valid email
vi: Vui lòng nhập email hợp lệ

# passwordLabel
source: Password
vi: Mật khẩu

# passwordValidation
source: Password must be at least 6 characters
vi: Mật khẩu phải có ít nhất 6 ký tự

# signInButton
source: Sign In
vi: Đăng nhập

# signInWithGoogleButton
source: Sign In with Google
vi: Đăng nhập với Google

# signUpPrompt
source: Don't have an account? Sign Up
vi: Chưa có tài khoản? Đăng ký

# forgotPasswordPrompt
source: Forgot password?
vi: Quên mật khẩu?

# loginFailedError
source: Login Failed: {errorDetails}
vi: Đăng nhập Thất bại: {errorDetails}

# signUpTitle
source: Sign Up
vi: Đăng ký

# displayNameLabel
source: Display Name
vi: Tên hiển thị

# displayNameValidation
source: Please enter your name
vi: Vui lòng nhập tên của bạn

# confirmPasswordLabel
source: Confirm Password
vi: Xác nhận Mật khẩu

# confirmPasswordValidationEmpty
source: Please confirm your password
vi: Vui lòng xác nhận mật khẩu

# confirmPasswordValidationMatch
source: Passwords do not match
vi: Mật khẩu không khớp

# signUpButton
source: Sign Up
vi: Đăng ký

# loginPrompt
source: Already have an account? Login
vi: Đã có tài khoản? Đăng nhập

# resetPasswordDialogTitle
source: Reset Password
vi: Đặt lại Mật khẩu

# enterYourEmailHint
source: Enter your account email
vi: Nhập email tài khoản của bạn

# sendResetEmailButton
source: Send Reset Email
vi: Gửi Email Đặt lại

# resetEmailSentSuccess
source: Password reset email sent to {email}. Please check your inbox (and spam folder).
vi: Email đặt lại mật khẩu đã được gửi đến {email}. Vui lòng kiểm tra hộp thư đến (và thư mục spam).

# resetEmailSentError
source: Failed to send reset email: {errorDetails}
vi: Gửi email đặt lại thất bại: {errorDetails}

# wifiConfigInstruction
source: Enter the WiFi network information for your ESP32 device.
vi: Nhập thông tin mạng WiFi cho thiết bị ESP32 của bạn.

# wifiSsidLabel
source: WiFi Network Name (SSID)
vi: Tên mạng WiFi (SSID)

# wifiSsidHint
source: E.g. MyHomeWiFi
vi: VD: MyHomeWiFi

# wifiSsidValidation
source: Please enter the WiFi network name
vi: Vui lòng nhập tên mạng WiFi

# wifiPasswordLabel
source: WiFi Password
vi: Mật khẩu WiFi

# wifiPasswordValidationLength
source: Password needs at least 8 characters
vi: Mật khẩu cần ít nhất 8 ký tự

# wifiOpenNetworkCheckbox
source: This is an open network (no password)
vi: Đây là mạng mở (không có mật khẩu)

# sendWifiConfigButton
source: Send Configuration
vi: Gửi Cấu hình

# deviceNotConnectedToSend
source: Device needs to be connected to send configuration.
vi: Cần kết nối thiết bị để gửi cấu hình.

# wifiConfigSentSuccess
source: WiFi configuration sent!
vi: Đã gửi cấu hình WiFi!

# wifiConfigSentError
source: Failed to send configuration.
vi: Gửi cấu hình thất bại.

# scanDevicesButton
source: Scan Devices
vi: Quét Thiết bị

# stopScanButton
source: Stop Scan
vi: Dừng Quét

# scanningTooltip
source: Scanning...
vi: Đang quét...

# scanTooltip
source: Scan for devices
vi: Quét thiết bị

# scanningStatus
source: Scanning for devices...
vi: Đang quét thiết bị...

# statusDisconnectedScan
source: Disconnected. Tap to scan.
vi: Đã ngắt kết nối. Nhấn quét.

# statusConnecting
source: Connecting...
vi: Đang kết nối...

# statusSettingUp
source: Setting up device...
vi: Đang thiết lập...

# statusConnected
source: Connected!
vi: Đã kết nối!

# statusErrorPermissions
source: Error. Check Permissions/Bluetooth.
vi: Lỗi. Kiểm tra quyền/Bluetooth.

# statusUnknown
source: Unknown
vi: Không xác định

source: No devices found.
vi: Không tìm thấy thiết bị nào.

# ensureDeviceNearby
source: Ensure your device is turned on and nearby.
vi: Đảm bảo thiết bị của bạn đã bật và ở gần.

# pullToScan
source: Pull down to scan again.
vi: Kéo xuống để quét lại.

source: Available Devices
vi: Thiết bị Khả dụng

# unknownDeviceName
source: Unknown Device
vi: Thiết bị không rõ

# connectButton
source: Connect
vi: Kết nối

# enableBluetoothPrompt
source: Please enable Bluetooth to scan for devices.
vi: Vui lòng bật Bluetooth để quét thiết bị.

# permissionRequiredPrompt
source: Location and Bluetooth permissions are required to find nearby devices. Please grant permissions in app settings.
vi: Cần cấp quyền Vị trí và Bluetooth để tìm thiết bị xung quanh. Vui lòng cấp quyền trong cài đặt ứng dụng.

# permissionDeniedSnackbar
source: Required permissions denied. Please grant in settings.
vi: Các quyền cần thiết bị từ chối. Vui lòng cấp quyền trong cài đặt.

# connectionFailedTitle
source: Connection Failed
vi: Kết nối Thất bại

# connectionFailedMessage
source: Could not connect to {deviceName}. Please ensure the device is nearby and try again.
vi: Không thể kết nối đến {deviceName}. Vui lòng đảm bảo thiết bị ở gần và thử lại.

# connectionFailedSnackbar
source: Failed to connect to device. Please try again.
vi: Kết nối thiết bị thất bại. Vui lòng thử lại.

# connectionTimeout
source: Connection timed out. Please try again.
vi: Kết nối quá thời gian. Vui lòng thử lại.

source: Device disconnected unexpectedly.
vi: Thiết bị đột ngột ngắt kết nối.

# bluetoothRequiredTitle
source: Bluetooth Required
vi: Yêu cầu Bluetooth

# bluetoothRequiredMessage
source: This app requires Bluetooth to be enabled to scan for devices.
vi: Ứng dụng này yêu cầu bật Bluetooth để quét thiết bị.

# turnOnButton
source: Turn On
vi: Bật

# enableBluetoothIOS
source: Please enable Bluetooth in system settings.
vi: Vui lòng bật Bluetooth trong cài đặt hệ thống.

# dailyStepGoalCardTitle
source: Daily Step Goal
vi: Mục tiêu Bước chân Ngày

# setNewGoalTooltip
source: Set New Goal
vi: Đặt Mục tiêu Mới

# stepsUnit
source: steps
vi: bước

# goalAchievedMessage
source: Goal Achieved! Well done! 🎉
vi: Đã đạt Mục tiêu! Làm tốt lắm! 🎉

# goalRemainingMessage
source: {remainingSteps} steps remaining
vi: Còn lại {remainingSteps} bước

# setGoalDialogTitle
source: Set Daily Step Goal
vi: Đặt Mục tiêu Bước chân Hàng ngày

# newGoalLabel
source: New Goal (E.g. 10000)
vi: Mục tiêu Mới (VD: 10000)

# pleaseEnterNumber
source: Please enter a number
vi: Vui lòng nhập một số

source: Invalid number
vi: Số không hợp lệ

# goalGreaterThanZero
source: Goal must be > 0
vi: Mục tiêu phải > 0

# goalTooHigh
source: Goal seems too high!
vi: Mục tiêu có vẻ quá cao!

# saveGoalButton
source: Save Goal
vi: Lưu Mục tiêu

# goalSavedSuccess
source: New step goal saved!
vi: Đã lưu mục tiêu bước mới!

# goalSavedError
source: Failed to save new goal.
vi: Lưu mục tiêu mới thất bại.

# activityTimeGoalTitle
source: Activity Time Goal
vi: Mục tiêu Thời gian Hoạt động

# activityTimeGoalProgress
source: Progress: ... / ... minutes
vi: Tiến độ: ... / ... phút

# calculatingStepsStatus
source: Calculating steps...
vi: Đang tính số bước...

# sectionNotifications
source: Notifications
vi: Thông báo

source: Enable Health Alerts
vi: Bật Cảnh báo Sức khỏe

# receiveAbnormalNotifications
source: Receive notifications for abnormal readings
vi: Nhận thông báo khi chỉ số bất thường

# loadingMessage
source: Loading...
vi: Đang tải...

# notificationChannelHealthAlertsName
source: Health Alerts
vi: Cảnh báo Sức khỏe

# notificationChannelHealthAlertsDesc
source: Notifications for abnormal health readings
vi: Thông báo khi chỉ số sức khỏe bất thường

# notificationChannelHrHighName
source: High Heart Rate Alert
vi: Cảnh báo Nhịp tim Cao

# notificationChannelHrHighDesc
source: Alerts for excessively high heart rate
vi: Cảnh báo khi nhịp tim quá cao

# notificationChannelHrLowName
source: Low Heart Rate Alert
vi: Cảnh báo Nhịp tim Thấp

# notificationChannelHrLowDesc
source: Alerts for excessively low heart rate
vi: Cảnh báo khi nhịp tim quá thấp

# notificationChannelSpo2LowName
source: Low SpO2 Alert
vi: Cảnh báo SpO2 Thấp

# notificationChannelSpo2LowDesc
source: Alerts for excessively low SpO2 levels
vi: Cảnh báo khi mức SpO2 quá thấp

# notificationChannelTestName
source: Test Notifications
vi: Thông báo Kiểm tra

# notificationChannelTestDesc
source: Channel for manual test notifications
vi: Kênh để kiểm tra thông báo thủ công

# alertHrHighTitle
source: High Heart Rate Alert!
vi: Cảnh báo Nhịp tim Cao!

# alertHrHighBody
source: Current heart rate is {hrValue} bpm, which is above the threshold of {threshold} bpm.
vi: Nhịp tim hiện tại là {hrValue} bpm, cao hơn ngưỡng {threshold} bpm.

# channelNameHrHigh
source: High Heart Rate Alerts
vi: Cảnh báo Nhịp tim Cao

# alertHrLowTitle
source: Low Heart Rate Alert!
vi: Cảnh báo Nhịp tim Thấp!

# alertHrLowBody
source: Current heart rate is {hrValue} bpm, which is below the threshold of {threshold} bpm.
vi: Nhịp tim hiện tại là {hrValue} bpm, thấp hơn ngưỡng {threshold} bpm.

# channelNameHrLow
source: Low Heart Rate Alerts
vi: Cảnh báo Nhịp tim Thấp

# alertSpo2LowTitle
source: Low SpO2 Alert!
vi: Cảnh báo SpO2 Thấp!

# alertSpo2LowBody
source: Current SpO2 is {spo2Value}%, which is below the threshold of {threshold}%.
vi: SpO2 hiện tại là {spo2Value}%, thấp hơn ngưỡng {threshold}%.

# channelNameSpo2Low
source: Low SpO2 Alerts
vi: Cảnh báo SpO2 Thấp

# loginWelcomeTitle
source: Welcome Back!
vi: Chào mừng trở lại!

# loginSubtitle
source: Login to continue
vi: Đăng nhập để tiếp tục

# orDividerText
source: OR
vi: HOẶC

# noAccountPrompt
source: Don't have an account?
vi: Chưa có tài khoản?

# signUpLinkText
source: Sign up now
vi: Đăng ký ngay

# temperatureLabel
source: Temperature
vi: Nhiệt độ

# pressureLabel
source: Pressure
vi: Áp suất

# connectingStatusDevice
source: Connecting...
vi: Đang kết nối...

# currentActivityTitle
source: Current Activity
vi: Hoạt động Hiện tại

# activityInitializing
source: Initializing...
vi: Đang khởi tạo...

# activityCycling
source: Cycling
vi: Đạp xe

# activityAscendingStairs
source: Ascending Stairs
vi: Leo cầu thang

# activityDescendingStairs
source: Descending Stairs
vi: Xuống cầu thang

# recordActivityTitle
source: Record Activity Data
vi: Ghi Dữ liệu Hoạt động

# selectActivityLabel
source: Select Activity to Record
vi: Chọn Hoạt động để Ghi

# startRecordingButton
source: Start Recording
vi: Bắt đầu Ghi

# stopRecordingButton
source: Stop Recording
vi: Dừng Ghi

# statusLabel
source: Status:
vi: Trạng thái:

# samplesRecordedLabel
source: Samples Recorded:
vi: Số mẫu đã ghi:

# viewRecordedDataHint
source: Recorded data path (tap to copy)
vi: Đường dẫn dữ liệu đã ghi (nhấn để sao chép)

# pathCopiedSnackbar
source: Path copied (simulated): {filePath}
vi: Đã sao chép đường dẫn (mô phỏng): {filePath}

# statusReconnecting
source: Attempting to reconnect...
vi: Đang kết nối lại...

# reconnectingTooltip
source: Attempting to reconnect...
vi: Đang thử kết nối lại...

# reconnectAttemptTitle
source: Reconnecting to Device
vi: Đang Thử Kết Nối Lại

# reconnectAttemptBody
source: Attempting to reconnect to your device...
vi: Đang cố gắng kết nối lại với thiết bị của bạn...

# reconnectSuccessTitle
source: Reconnect Successful
vi: Kết nối lại thành công

# reconnectSuccessBody
source: Successfully reconnected to your device.
vi: Đã kết nối lại thành công với thiết bị của bạn.

# reconnectFailedTitle
source: Reconnect Failed
vi: Kết nối lại thất bại

# reconnectFailedBody
source: Could not reconnect to device after {attempts} attempts.
vi: Không thể kết nối lại với thiết bị sau {attempts} lần thử.

# bleReconnectChannelName
source: BLE Reconnect
vi: Kết nối lại BLE

# activityWarningTitle
source: Activity Alert
vi: Cảnh báo Hoạt động

# prolongedSittingWarningTitle
source: Prolonged Sitting Alert
vi: Cảnh báo Ngồi Lâu

# prolongedLyingWarningTitle
source: Prolonged Lying Alert (Daytime)
vi: Cảnh báo Nằm Lâu (Ban Ngày)

# smartReminderTitle
source: Smart Movement Reminder
vi: Nhắc nhở Vận động Thông minh

# positiveFeedbackTitle
source: Great Job!
vi: Làm tốt lắm!

# activityAlertsChannelName
source: Activity Alerts
vi: Cảnh báo Hoạt động

# activityAlertsChannelDescription
source: Notifications related to activity alerts
vi: Thông báo liên quan đến cảnh báo hoạt động

# sittingAlertsChannelName
source: Sitting Time Alerts
vi: Cảnh báo Thời gian Ngồi

# lyingAlertsChannelName
source: Lying Time Alerts
vi: Cảnh báo Thời gian Nằm

# smartReminderChannelName
source: Smart Movement Reminders
vi: Nhắc nhở Vận động Thông minh

# positiveFeedbackChannelName
source: Positive Feedback
vi: Phản hồi Tích cực

source: Try Again
vi: Thử lại

# errorLoadingData
source: Could not load device data. Please try again.
vi: Không thể tải dữ liệu thiết bị. Vui lòng thử lại.

# bluetoothRequestTitle
source: Enable Bluetooth
vi: Bật Bluetooth

# bluetoothRequestMessage
source: Please enable Bluetooth to scan for devices.
vi: Vui lòng bật Bluetooth để quét thiết bị.

source: Turn On
vi: Bật

# recordScreenInitialStatus
source: Select an activity and press Start.
vi: Chọn một hoạt động và nhấn Bắt đầu.

# recordScreenSelectActivityFirst
source: Please select an activity before starting.
vi: Vui lòng chọn một hoạt động trước khi bắt đầu.

# recordScreenAlreadyRecording
source: Recording is already in progress.
vi: Quá trình ghi đang được thực hiện.

# permissionDeniedStorage
source: Storage permission denied. Cannot record data.
vi: Quyền truy cập bộ nhớ bị từ chối. Không thể ghi dữ liệu.

# errorGettingPath
source: Error getting file path: {error}
vi: Lỗi khi lấy đường dẫn tệp: {error}

# recordScreenRecordingTo
source: Recording to: {filePath}
vi: Đang ghi vào: {filePath}

# recordScreenSamplesRecorded
source: Recording {activityName}: {count} samples (saved).
vi: Đang ghi {activityName}: {count} mẫu (đã lưu).

# recordScreenStreamError
source: Error on data stream: {error}. Recording stopped.
vi: Lỗi trên luồng dữ liệu: {error}. Đã dừng ghi.

# recordScreenStreamEnded
source: Data stream ended. Recording stopped.
vi: Luồng dữ liệu đã kết thúc. Đã dừng ghi.

# recordScreenStartError
source: Error starting recording: {error}
vi: Lỗi khi bắt đầu ghi: {error}

# recordScreenStopMessage
source: Recording stopped. {count} samples recorded to: {filePath}
vi: Đã dừng ghi. {count} mẫu được ghi vào: {filePath}

# recordScreenSelectActivityValidation
source: Please select an activity.
vi: Vui lòng chọn một hoạt động.

# copyFilePathButton
source: Copy File Path
vi: Sao chép Đường dẫn Tệp

# filePathCopiedSuccess
source: File path copied: {filePath}
vi: Đã sao chép đường dẫn tệp: {filePath}

# wifiConfigDeviceNotConnectedError
source: Device not connected. Please connect to the wearable first.
vi: Thiết bị chưa được kết nối. Vui lòng kết nối với thiết bị đeo trước.

# activityStanding
source: Standing
vi: Đứng

# activityLying
source: Lying
vi: Nằm

# activitySitting
source: Sitting
vi: Ngồi

# activityWalking
source: Walking
vi: Đi bộ

# activityRunning
source: Running
vi: Chạy

# activityUnknown
source: Unknown Activity
vi: Hoạt động không xác định

source: Activity Error
vi: Lỗi Hoạt động

# activitySummaryTitle
source: Activity Summary
vi: Tổng kết Hoạt động Hôm nay

# activitySummaryNoData
source: Not enough activity data recorded for today yet.
vi: Không có dữ liệu hoạt động cho hôm nay.

# activitySummaryNoDataToDisplay
source: No significant activity to display.
vi: Không có hoạt động nào đáng kể để hiển thị.

# activitySummaryDetailScreenTitle
source: Activity Timeline
vi: Chi tiết Hoạt động
